wosayttn/M55M1BSP/_CUnit/dmic/dmic_cunit.c
/******************************************************************************
* @file    dmic_cunit.c
* @version V1.00
* @brief   CUnit test dmic
*
* SPDX-License-Identifier: Apache-2.0
* @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "dmic_cunit.h"

#define SAMPLERATE_8K 8000
#define SAMPLERATE_16K 16000
#define SAMPLERATE_48K 48000

DMIC_VAD_BIQ_T sVAD_BIQCoeff;

int dmic_Test_Init(void)
{
    CLK_EnableAPLL(CLK_APLLCTL_APLLSRC_HIRC, 196575000, CLK_APLL1_SELECT);
    CLK_EnableXtalRC(CLK_SRCCTL_MIRCEN_Msk);
    CLK_WaitClockReady(CLK_STATUS_MIRCSTB_Msk);
    SYS->HIRC48MCFCTL = 0x00009999;
    CLK_EnableXtalRC(CLK_SRCCTL_HIRC48MEN_Msk);
    CLK_WaitClockReady(CLK_STATUS_HIRC48MSTB_Msk);

    CLK_EnableModuleClock(DMIC0_MODULE);
    CLK_EnableModuleClock(VAD0SEL_MODULE);
    return 0;
}
int dmic_Test_Clean(void)
{
    return 0;
}

void Const_DMIC_Test(void)
{
		CU_ASSERT_EQUAL(DMIC_CTL_FIFOWIDTH_24, (DMIC_CTL_FIFOWIDTH_Msk));
		CU_ASSERT_EQUAL(DMIC_CTL_FIFOWIDTH_16, (0UL << DMIC_CTL_FIFOWIDTH_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_GAINSTEP_1_2, (0UL << DMIC_CTL_GAINSTEP_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_GAINSTEP_1_4, (1UL << DMIC_CTL_GAINSTEP_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_GAINSTEP_1_8, (2UL << DMIC_CTL_GAINSTEP_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_GAINSTEP_1_16, (3UL << DMIC_CTL_GAINSTEP_Pos));
		CU_ASSERT_EQUAL(DMIC_DIV_DOWNSAMPLE_64, (0x0UL<<DMIC_DIV_OSR_Pos));
		CU_ASSERT_EQUAL(DMIC_DIV_DOWNSAMPLE_128, (0x1UL<<DMIC_DIV_OSR_Pos));
		CU_ASSERT_EQUAL(DMIC_DIV_DOWNSAMPLE_256, (0x2UL<<DMIC_DIV_OSR_Pos));
		CU_ASSERT_EQUAL(DMIC_DIV_DOWNSAMPLE_100, (0x3UL<<DMIC_DIV_OSR_Pos));
		CU_ASSERT_EQUAL(DMIC_DIV_DOWNSAMPLE_50, (0x7UL<<DMIC_DIV_OSR_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_LATCHDATA_CH01F, (0x0UL<<DMIC_CTL_LCHEDGE01_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_LATCHDATA_CH01R, (0x1UL<<DMIC_CTL_LCHEDGE01_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_LATCHDATA_CH23F, (0x0UL<<DMIC_CTL_LCHEDGE23_Pos));
		CU_ASSERT_EQUAL(DMIC_CTL_LATCHDATA_CH23R, (0x1UL<<DMIC_CTL_LCHEDGE23_Pos));
    CU_PASS();
}

void Const_VAD_Test(void)
{
		CU_ASSERT_EQUAL(VAD_SINC_CTL_DOWNSAMPLE_48, (0x0UL<<VAD_SINCCTL_SINCOSR_Pos));
		CU_ASSERT_EQUAL(VAD_SINC_CTL_DOWNSAMPLE_64, (0x1UL<<VAD_SINCCTL_SINCOSR_Pos));
		CU_ASSERT_EQUAL(VAD_SINC_CTL_DOWNSAMPLE_96, (0x2UL<<VAD_SINCCTL_SINCOSR_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_STAT_16MS, (0x99UL<<VAD_CTL0_STAT_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_STAT_8MS, (0xAAUL<<VAD_CTL0_STAT_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_STAT_4MS, (0xBBUL<<VAD_CTL0_STAT_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_STAT_2MS, (0xCCUL<<VAD_CTL0_STAT_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_LTAT_512MS, (0x4UL<<VAD_CTL0_LTAT_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_LTAT_256MS, (0x5UL<<VAD_CTL0_LTAT_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_LTAT_128MS, (0x6UL<<VAD_CTL0_LTAT_Pos));
		CU_ASSERT_EQUAL(VAD_CTL0_LTAT_64MS, (0x7UL<<VAD_CTL0_LTAT_Pos));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_0DB, (0x0001UL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_10DB, (0x0003UL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_20DB, (0x000AUL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_30DB, (0x0020UL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_40DB, (0x0067UL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_50DB, (0x0147UL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_60DB, (0x040CUL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_70DB, (0x0CCCUL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_80DB, (0x2879UL));
		CU_ASSERT_EQUAL(VAD_POWERTHRE_90DB, (0x7FFFUL));
    CU_PASS();
}

void INLINE_FUN_Test(void)
{
		DMIC_SetFIFOWidth(DMIC0, DMIC_CTL_FIFOWIDTH_24);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_FIFOWIDTH_Msk, BIT31);

		DMIC_SetFIFOWidth(DMIC0, DMIC_CTL_FIFOWIDTH_16);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_FIFOWIDTH_Msk, 0);

		DMIC_SetGainStep(DMIC0, DMIC_CTL_GAINSTEP_1_2);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_GAINSTEP_Msk, 0);

		DMIC_SetGainStep(DMIC0, DMIC_CTL_GAINSTEP_1_4);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_GAINSTEP_Msk, BIT27);

		DMIC_SetGainStep(DMIC0, DMIC_CTL_GAINSTEP_1_8);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_GAINSTEP_Msk, BIT28);

		DMIC_SetGainStep(DMIC0, DMIC_CTL_GAINSTEP_1_16);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_GAINSTEP_Msk, BIT27|BIT28);
	 
		DMIC_ResetDSP(DMIC0);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_SWRST_Msk, 0);

		DMIC_EnableHPF(DMIC0, DMIC_CTL_CH01HPFEN_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH01HPFEN_Msk, BIT20);

		DMIC_DisableHPF(DMIC0, DMIC_CTL_CH01HPFEN_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH01HPFEN_Msk, 0);

		DMIC_EnableHPF(DMIC0, DMIC_CTL_CH23HPFEN_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH23HPFEN_Msk, BIT21);

		DMIC_DisableHPF(DMIC0, DMIC_CTL_CH23HPFEN_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH23HPFEN_Msk, 0);

		DMIC_EnableHPF(DMIC0, DMIC_CTL_CH01HPFEN_Msk|DMIC_CTL_CH23HPFEN_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CH01HPFEN_Msk|DMIC_CTL_CH23HPFEN_Msk), BIT20|BIT21);

		DMIC_DisableHPF(DMIC0, DMIC_CTL_CH01HPFEN_Msk|DMIC_CTL_CH23HPFEN_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CH01HPFEN_Msk|DMIC_CTL_CH23HPFEN_Msk), 0);

		DMIC_EnableMute(DMIC0, DMIC_CTL_CH0MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH0MUTE_Msk, BIT12);

		DMIC_DisableMute(DMIC0, DMIC_CTL_CH0MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH0MUTE_Msk, 0);

		DMIC_EnableMute(DMIC0, DMIC_CTL_CH1MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH1MUTE_Msk, BIT13);

		DMIC_DisableMute(DMIC0, DMIC_CTL_CH1MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH1MUTE_Msk, 0);

		DMIC_EnableMute(DMIC0, DMIC_CTL_CH2MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH2MUTE_Msk, BIT14);

		DMIC_DisableMute(DMIC0, DMIC_CTL_CH2MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH2MUTE_Msk, 0);

		DMIC_EnableMute(DMIC0, DMIC_CTL_CH3MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH3MUTE_Msk, BIT15);

		DMIC_DisableMute(DMIC0, DMIC_CTL_CH3MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CH3MUTE_Msk, 0);

		DMIC_EnableMute(DMIC0, DMIC_CTL_CH1MUTE_Msk|DMIC_CTL_CH2MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CH1MUTE_Msk|DMIC_CTL_CH2MUTE_Msk), BIT13|BIT14);

		DMIC_DisableMute(DMIC0, DMIC_CTL_CH1MUTE_Msk|DMIC_CTL_CH2MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CH1MUTE_Msk|DMIC_CTL_CH2MUTE_Msk), 0);

		DMIC_EnableMute(DMIC0, DMIC_CTL_CH0MUTE_Msk|DMIC_CTL_CH3MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CH0MUTE_Msk|DMIC_CTL_CH3MUTE_Msk), BIT12|BIT15);

		DMIC_DisableMute(DMIC0, DMIC_CTL_CH0MUTE_Msk|DMIC_CTL_CH3MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CH0MUTE_Msk|DMIC_CTL_CH3MUTE_Msk), 0);

		DMIC_EnableMute(DMIC0, DMIC_CTL_CH1MUTE_Msk|DMIC_CTL_CH2MUTE_Msk|DMIC_CTL_CH0MUTE_Msk|DMIC_CTL_CH3MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (0xF000), 0xF000);

		DMIC_DisableMute(DMIC0, DMIC_CTL_CH1MUTE_Msk|DMIC_CTL_CH2MUTE_Msk|DMIC_CTL_CH0MUTE_Msk|DMIC_CTL_CH3MUTE_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (0xF000), 0);

