wosayttn/M55M1BSP/_CUnit/dmic/dmic_cunit.c
    sVAD_BIQCoeff.u16BIQCoeffA1=0xc715;
    sVAD_BIQCoeff.u16BIQCoeffA2=0x19a0;
    sVAD_BIQCoeff.u16BIQCoeffB0=0x1ca3;
    sVAD_BIQCoeff.u16BIQCoeffB1=0xc6bb;
    sVAD_BIQCoeff.u16BIQCoeffB2=0x1ca3;
		DMIC_VAD_SetBIQCoeff(VAD0, &sVAD_BIQCoeff);
		CU_ASSERT_EQUAL(VAD0->BIQCTL0 & VAD_BIQCTL0_BIQA1_Msk, 0xc715);
		CU_ASSERT_EQUAL(VAD0->BIQCTL0 & VAD_BIQCTL0_BIQA2_Msk, 0x19a00000);
		CU_ASSERT_EQUAL(VAD0->BIQCTL1 & VAD_BIQCTL1_BIQB0_Msk, 0x1ca3);
		CU_ASSERT_EQUAL(VAD0->BIQCTL1 & VAD_BIQCTL1_BIQB1_Msk, 0xc6bb0000);
		CU_ASSERT_EQUAL(VAD0->BIQCTL2 & VAD_BIQCTL2_BIQB2_Msk, 0x1ca3);

    CU_PASS();
}

void Macro_DMIC_Test(void)
{
		DMIC_SET_LATCH01DATA(DMIC0, DMIC_CTL_LATCHDATA_CH01RF);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_LCHEDGE01_Msk, BIT8);

		DMIC_SET_LATCH01DATA(DMIC0, DMIC_CTL_LATCHDATA_CH01FR);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_LCHEDGE01_Msk, 0);

		DMIC_SET_LATCH23DATA(DMIC0, DMIC_CTL_LATCHDATA_CH23RF);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_LCHEDGE23_Msk, BIT9);

		DMIC_SET_LATCH23DATA(DMIC0, DMIC_CTL_LATCHDATA_CH23FR);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_LCHEDGE23_Msk, 0);

		DMIC_ENABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN0_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN0_Msk, BIT0);

		DMIC_DISABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN0_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN0_Msk, 0);

		DMIC_ENABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN1_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN1_Msk, BIT1);

		DMIC_DISABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN1_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN1_Msk, 0);

		DMIC_ENABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN2_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN2_Msk, BIT2);

		DMIC_DISABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN2_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN2_Msk, 0);

		DMIC_ENABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN3_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN3_Msk, BIT3);

		DMIC_DISABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN3_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & DMIC_CTL_CHEN3_Msk, 0);

		DMIC_ENABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN1_Msk|DMIC_CTL_CHEN2_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CHEN1_Msk|DMIC_CTL_CHEN2_Msk), BIT1|BIT2);

		DMIC_DISABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN1_Msk|DMIC_CTL_CHEN2_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CHEN1_Msk|DMIC_CTL_CHEN2_Msk), 0);

		DMIC_ENABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN0_Msk|DMIC_CTL_CHEN3_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CHEN0_Msk|DMIC_CTL_CHEN3_Msk), BIT0|BIT3);

		DMIC_DISABLE_CHANNEL(DMIC0, DMIC_CTL_CHEN0_Msk|DMIC_CTL_CHEN3_Msk);
		CU_ASSERT_EQUAL(DMIC0->CTL & (DMIC_CTL_CHEN0_Msk|DMIC_CTL_CHEN3_Msk), 0);

		DMIC_ENABLE_FIFOTHRESHOLDINT(DMIC0, 0xA);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_DMTHIE_Msk|DMIC_DIV_DMTH_Msk), BIT21|0xA0000);

		DMIC_DISABLE_FIFOTHRESHOLDINT(DMIC0);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_DMTHIE_Msk|DMIC_DIV_DMTH_Msk), 0xA0000);

		DMIC_ENABLE_FIFOTHRESHOLDINT(DMIC0, 0x15);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_DMTHIE_Msk|DMIC_DIV_DMTH_Msk), BIT21|0x150000);

		DMIC_DISABLE_FIFOTHRESHOLDINT(DMIC0);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_DMTHIE_Msk|DMIC_DIV_DMTH_Msk), 0x150000);

		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_OSR_Msk), 0);

		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_OSR_Msk), BIT24);

		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_OSR_Msk), BIT25);

		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_OSR_Msk), BIT24|BIT25);

		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
		CU_ASSERT_EQUAL(DMIC0->DIV & (DMIC_DIV_OSR_Msk), BIT26|BIT24|BIT25);

		DMIC_ENABLE_LPPDMA(DMIC0);
		CU_ASSERT_EQUAL(DMIC0->LPPDMACTL & (DMIC_LPPDMACTL_LPPDMAEN_Msk), 1);

		DMIC_DISABLE_LPPDMA(DMIC0);
		CU_ASSERT_EQUAL(DMIC0->LPPDMACTL & (DMIC_LPPDMACTL_LPPDMAEN_Msk), 0);

		CU_ASSERT_EQUAL(DMIC_IS_FIFOEMPTY(DMIC0), BIT1);

		CU_ASSERT_EQUAL(DMIC_IS_FIFOFULL(DMIC0), 0);

		CU_ASSERT_EQUAL(DMIC_IS_FIFODMTH(DMIC0), 0);

    CU_PASS();
}

void Macro_VAD_Test(void)
{
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_64);
		CU_ASSERT_EQUAL(VAD0->SINCCTL & VAD_SINCCTL_SINCOSR_Msk, BIT8);

		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_96);
		CU_ASSERT_EQUAL(VAD0->SINCCTL & VAD_SINCCTL_SINCOSR_Msk, BIT9);

		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_48);
		CU_ASSERT_EQUAL(VAD0->SINCCTL & VAD_SINCCTL_SINCOSR_Msk, 0);

		DMIC_VAD_ENABLE(VAD0);
		CU_ASSERT_EQUAL(VAD0->SINCCTL & VAD_SINCCTL_VADEN_Msk, BIT31);

		DMIC_VAD_DISABLE(VAD0);
		CU_ASSERT_EQUAL(VAD0->SINCCTL & VAD_SINCCTL_VADEN_Msk, 0);

		DMIC_VAD_SET_STAT(VAD0, VAD_CTL0_STAT_16MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_STAT_Msk, 0x99);

		DMIC_VAD_SET_STAT(VAD0, VAD_CTL0_STAT_8MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_STAT_Msk, 0xAA);

		DMIC_VAD_SET_STAT(VAD0, VAD_CTL0_STAT_4MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_STAT_Msk, 0xBB);

		DMIC_VAD_SET_STAT(VAD0, VAD_CTL0_STAT_2MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_STAT_Msk, 0xCC);

		DMIC_VAD_SET_LTAT(VAD0, VAD_CTL0_LTAT_512MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_LTAT_Msk, (0x4UL<<VAD_CTL0_LTAT_Pos));

		DMIC_VAD_SET_LTAT(VAD0, VAD_CTL0_LTAT_256MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_LTAT_Msk, (0x5UL<<VAD_CTL0_LTAT_Pos));

		DMIC_VAD_SET_LTAT(VAD0, VAD_CTL0_LTAT_128MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_LTAT_Msk, (0x6UL<<VAD_CTL0_LTAT_Pos));

		DMIC_VAD_SET_LTAT(VAD0, VAD_CTL0_LTAT_64MS);
		CU_ASSERT_EQUAL(VAD0->CTL0 & VAD_CTL0_LTAT_Msk, (0x7UL<<VAD_CTL0_LTAT_Pos));

		DMIC_VAD_SET_STTHRE(VAD0, VAD_POWERTHRE_0DB);
		CU_ASSERT_EQUAL(VAD0->CTL1 & VAD_CTL1_STTHREHWM_Msk, (0x0001UL));

		DMIC_VAD_SET_STTHRE(VAD0, VAD_POWERTHRE_10DB);
		CU_ASSERT_EQUAL(VAD0->CTL1 & VAD_CTL1_STTHREHWM_Msk, (0x0003UL));

		DMIC_VAD_SET_STTHRE(VAD0, VAD_POWERTHRE_20DB);
		CU_ASSERT_EQUAL(VAD0->CTL1 & VAD_CTL1_STTHREHWM_Msk, (0x000AUL));

		DMIC_VAD_SET_STTHRE(VAD0, VAD_POWERTHRE_30DB);
		CU_ASSERT_EQUAL(VAD0->CTL1 & VAD_CTL1_STTHREHWM_Msk, (0x0020UL));

		DMIC_VAD_SET_LTTHRE(VAD0, VAD_POWERTHRE_40DB);
		CU_ASSERT_EQUAL(VAD0->CTL2 & VAD_CTL2_LTTHRE_Msk, (0x0067UL<<VAD_CTL2_LTTHRE_Pos));

		DMIC_VAD_SET_LTTHRE(VAD0, VAD_POWERTHRE_50DB);
		CU_ASSERT_EQUAL(VAD0->CTL2 & VAD_CTL2_LTTHRE_Msk, (0x0147UL<<VAD_CTL2_LTTHRE_Pos));

