wosayttn/M55M1BSP/_CUnit/dmic/dmic_cunit.c
		DMIC_VAD_SET_LTTHRE(VAD0, VAD_POWERTHRE_60DB);
		CU_ASSERT_EQUAL(VAD0->CTL2 & VAD_CTL2_LTTHRE_Msk, (0x040CUL<<VAD_CTL2_LTTHRE_Pos));

		DMIC_VAD_SET_LTTHRE(VAD0, VAD_POWERTHRE_70DB);
		CU_ASSERT_EQUAL(VAD0->CTL2 & VAD_CTL2_LTTHRE_Msk, (0x0CCCUL<<VAD_CTL2_LTTHRE_Pos));

		DMIC_VAD_SET_DEVTHRE(VAD0, VAD_POWERTHRE_80DB);
		CU_ASSERT_EQUAL(VAD0->CTL3 & VAD_CTL3_DEVTHRE_Msk, (0x2879UL));

		DMIC_VAD_SET_DEVTHRE(VAD0, VAD_POWERTHRE_90DB);
		CU_ASSERT_EQUAL(VAD0->CTL3 & VAD_CTL3_DEVTHRE_Msk, (0x7FFFUL));

		DMIC_VAD_ENABLE_BIQ(VAD0);
		CU_ASSERT_EQUAL(VAD0->BIQCTL2 & VAD_BIQCTL2_BIQEN_Msk, BIT31);

		DMIC_VAD_DISABLE_BIQ(VAD0);
		CU_ASSERT_EQUAL(VAD0->BIQCTL2 & VAD_BIQCTL2_BIQEN_Msk, 0);

    CU_PASS();
}

void Func1_Test(void)
{
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN0_Msk, -20);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL0 & DMIC_GAINCTL0_CHyyLVOL_Msk, 0xCA00);
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN0_Msk, 0);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL0 & DMIC_GAINCTL0_CHyyLVOL_Msk, 0xC000);
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN1_Msk, -20);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL0 & DMIC_GAINCTL0_CHxxRVOL_Msk, 0xCA000000);
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN1_Msk, 0);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL0 & DMIC_GAINCTL0_CHxxRVOL_Msk, 0xC0000000);
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN2_Msk, -20);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL1 & DMIC_GAINCTL1_CHyyLVOL_Msk, 0xCA00);
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN2_Msk, 0);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL1 & DMIC_GAINCTL1_CHyyLVOL_Msk, 0xC000);
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN3_Msk, -20);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL1 & DMIC_GAINCTL1_CHxxRVOL_Msk, 0xCA000000);
    DMIC_SetDSPGainVolume(DMIC0, DMIC_CTL_CHEN3_Msk, 0);
		CU_ASSERT_EQUAL(DMIC0->GAINCTL1 & DMIC_GAINCTL1_CHxxRVOL_Msk, 0xC0000000);
    CU_PASS();
}

void Func_DMIC_SetSampleRate(void)
{
    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_HIRC, CLK_DMICDIV_DMIC0DIV(1));
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), SAMPLERATE_8K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), SAMPLERATE_8K);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), SAMPLERATE_16K);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_48K), SAMPLERATE_48K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_48K), SAMPLERATE_48K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8522);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8152);
    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_MIRC, CLK_DMICDIV_DMIC0DIV(1));
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), SAMPLERATE_8K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), SAMPLERATE_8K);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), SAMPLERATE_16K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), SAMPLERATE_16K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 10416);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8928);
    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_PCLK4, CLK_DMICDIV_DMIC0DIV(1));
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8064);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), 16129);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8064);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), 16129);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8138);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), 16276);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_48K), 48828);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8138);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), 16276);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_48K), 48828);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8138);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), 16276);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_48K), 48828);
    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_HIRC48M, CLK_DMICDIV_DMIC0DIV(1));
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), SAMPLERATE_8K);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), SAMPLERATE_16K);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_48K), SAMPLERATE_48K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), SAMPLERATE_8K);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), SAMPLERATE_16K);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_48K), SAMPLERATE_48K);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8152);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8152);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), 16304);
		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_8K), 8152);
	  CU_ASSERT_EQUAL(DMIC_SetSampleRate(DMIC0, SAMPLERATE_16K), 16304);	
	
//    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_HIRC, CLK_DMICDIV_DMIC0DIV(1));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
//	  printf("100DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
//	  printf("50DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
//	  printf("256DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
//	  printf("128DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
//	  printf("64DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_MIRC, CLK_DMICDIV_DMIC0DIV(1));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
//	  printf("100DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
//	  printf("50DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
//	  printf("256DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
//	  printf("128DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
//	  printf("64DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_PCLK4, CLK_DMICDIV_DMIC0DIV(1));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
//	  printf("100DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
//	  printf("50DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
//	  printf("256DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
//	  printf("128DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
//	  printf("64DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_HIRC48M, CLK_DMICDIV_DMIC0DIV(1));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
//	  printf("100DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
//	  printf("50DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
//	  printf("256DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
//	  printf("128DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
//	  printf("64DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//    CLK_SetModuleClock(DMIC0_MODULE, CLK_DMICSEL_DMIC0SEL_APLL1_DIV2, CLK_DMICDIV_DMIC0DIV(1));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_100);
//	  printf("100DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_50);
//	  printf("50DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_256);
//	  printf("256DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_128);
//	  printf("128DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
//		DMIC_SET_DOWMSAMPLE(DMIC0, DMIC_DIV_DOWNSAMPLE_64);
//	  printf("64DMIC_SetSampleRate(DMIC0, 8000) %d\n", DMIC_SetSampleRate(DMIC0, 8000));
//	  printf("DMIC_SetSampleRate(DMIC0, 16000) %d\n", DMIC_SetSampleRate(DMIC0, 16000));
//	  printf("DMIC_SetSampleRate(DMIC0, 24000) %d\n", DMIC_SetSampleRate(DMIC0, 24000));
//	  printf("DMIC_SetSampleRate(DMIC0, 32000) %d\n", DMIC_SetSampleRate(DMIC0, 32000));
//	  printf("DMIC_SetSampleRate(DMIC0, 40000) %d\n", DMIC_SetSampleRate(DMIC0, 40000));
//	  printf("DMIC_SetSampleRate(DMIC0, 48000) %d\n", DMIC_SetSampleRate(DMIC0, 48000));
    CU_PASS();
}

