wosayttn/M55M1BSP/_CUnit/dmic/dmic_cunit.c
void Func_VAD_SetSampleRate(void)
{
    CLK_SetModuleClock(VAD0SEL_MODULE, CLK_DMICSEL_VAD0SEL_HIRC, 0);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_48);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 8928);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_96);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 10416);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_64);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 9375);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_48K), 46875);
    CLK_SetModuleClock(VAD0SEL_MODULE, CLK_DMICSEL_VAD0SEL_MIRC, 0);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_48);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 10416);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_96);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 10416);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_64);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_16K), 15625);
    CLK_SetModuleClock(VAD0SEL_MODULE, CLK_DMICSEL_VAD0SEL_PCLK4, 0);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_48);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 8138);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_16K), 16276);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_96);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 8138);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_16K), 16276);
		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_64);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_8K), 8138);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_16K), 16276);
	  CU_ASSERT_EQUAL(DMIC_VAD_SetSampleRate(VAD0, SAMPLERATE_48K), 48828);
//    CLK_SetModuleClock(VAD0SEL_MODULE, CLK_DMICSEL_VAD0SEL_HIRC, 0);
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_48);
//	  printf("48DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_96);
//	  printf("96DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_64);
//	  printf("64DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//    CLK_SetModuleClock(VAD0SEL_MODULE, CLK_DMICSEL_VAD0SEL_MIRC, 0);
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_48);
//	  printf("48DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_96);
//	  printf("96DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_64);
//	  printf("64DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//    CLK_SetModuleClock(VAD0SEL_MODULE, CLK_DMICSEL_VAD0SEL_PCLK4, 0);
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_48);
//	  printf("48DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_96);
//	  printf("96DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
//		DMIC_VAD_SET_DOWMSAMPLE(VAD0, VAD_SINC_CTL_DOWNSAMPLE_64);
//	  printf("64DMIC_VAD_SetSampleRate(VAD0, 8000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 8000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 16000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 16000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 24000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 24000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 32000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 32000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 40000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 40000));
//	  printf("DMIC_VAD_SetSampleRate(VAD0, 48000) %d\n", DMIC_VAD_SetSampleRate(VAD0, 48000));
    CU_PASS();
}

CU_SuiteInfo dmicSuites[] = {
    { "dmic Const Test", dmic_Test_Init, dmic_Test_Clean, NULL, NULL, dmic_ConstTest },
    { "dmic Macro Test", dmic_Test_Init, dmic_Test_Clean, NULL, NULL, dmic_MacroTest },
    { "dmic Func  Test", dmic_Test_Init, dmic_Test_Clean, NULL, NULL, dmic_FuncTest },
    CU_SUITE_INFO_NULL
};

CU_TestInfo  dmic_ConstTest[] = {
    { "DMIC Const",  Const_DMIC_Test },
    { "VAD Const",  Const_VAD_Test },
    CU_TEST_INFO_NULL
};

CU_TestInfo  dmic_MacroTest[] = {
    { "DMIC Macro",  Macro_DMIC_Test },
    { "VAD Macro",  Macro_VAD_Test },
    CU_TEST_INFO_NULL
};

CU_TestInfo  dmic_FuncTest[] = {
    { "INLINE Func", INLINE_FUN_Test },
    { "Func1", Func1_Test },
    { "DMIC_SetSampleRate Func", Func_DMIC_SetSampleRate },
    { "VAD_SetSampleRate Func", Func_VAD_SetSampleRate },
    CU_TEST_INFO_NULL
};

/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/